Repository: matro7sh/smersh-cli
Catalog: smersh_cli/locale/*/LC_MESSAGES/smersh-cli.po
Languages: fr

source: The object type to query information about.
fr: Le type de l'objet dont vous voulez obtenir des informations.

source: A list of identifiers (separated by spaces) of specific objects to print information about. If this list is empty, the program will print every object.
fr: Les identifiants (séparés par des espaces) des objets à afficher. Si la liste est vide, le programme affichera tous les objets.

source: Whether to print the data in raw (without formatting) or in a table. Default is to print in a table.
fr: Affiche les données au format brut.

source: An optional identifier. If omitted, the command will assume you want to create a new object.
fr: L'identifiant de l'objet à sélectionner. Laissez vide si vous souhaitez créér un nouvel objet.

source: The object ID must be positive
fr: L'ID de l'objet doit être positif

source: Boolean value expected
fr: Un booléen est attendu

source: Invalid role name: {}
fr: Nom de rôle invalide : {}

source: The path to the file to upload.
fr: Le chemin du fichier à téléverser.

source: [red]There is no context
fr: [red]Aucun objet sélectionné

source: [yellow]Unable to find an object with id: {}
fr: [yellow]Impossible de trouver l'objet ayant pour identifiant : {}

source: [red]An HTTP error occurred: {}
fr: [red]Une erreur HTTP est survenue : {}

source: Your request returned no object :(
fr: Votre requête n'a retourné aucun résultat :(

source: [red]You must enter into a context before setting a field
fr: [red]Vous devez sélectionner un objet avant de modifier un champ

source: [yellow]The item "{}" was already added into the field named "{}"
fr: [yellow]L'élément "{}" a déjà été ajouté dans le champ nommé "{}"

source: [red]You have no context to exit
fr: [red]Il n'y a aucun objet sélectionné

source: [red]You need to be in a context to save something
fr: [red]Vous devez sélectionner un objet avant de sauvegarder

source: [green]The object was saved successfully
fr: [green]L'objet a été sauvegardé avec succès

source: [red]You must set every object identifier before saving
fr: [red]Vous devez renseigner tous les identifiants d'objet avant de sauvegarder

source: [red]Unable to save the object: {}
fr: [red]Impossible de sauvegarder l'objet : {}

source: [red]You must be in a context to delete something
fr: [red]Vous devez sélectionner un objet pour le supprimer

source: [red]You can't delete a NEW object
fr: [red]Vous ne pouvez pas supprimer un nouvel objet

source: [green]The object was deleted successfully
fr: [green]L'objet a été supprimé avec succès

source: [red]An error occurred. Unable to delete the object
fr: [red]Une erreur est survenur. Impossible de supprimer l'objet

source: [red]The file {} does not exist or is not a regular file
fr: [red]Le fichier {} n'existe pas ou n'est pas un fichier régulier

source: [yellow]{} domains have been rejected:
fr: [yellow]{} domaines ont été rejetés :

source: [green]The hosts file has been successfully uploaded
fr: [green]Le fichier d'hôtes à été téléversé avec succès

source: [red]You must be in a mission context to use this command
fr: [red]Vous devez sélectionner une mission avant d'utiliser cette commande

source: [1;39mNEW[0m
fr: [1;39mNOUVEAU[0m

source: Yes
fr: Oui

source: No
fr: Non

source: Name
fr: Nom

source: Duration
fr: Durée

source: Status
fr: État

source: Hosts
fr: Hôtes

source: Done
fr: Fait

source: To do
fr: À faire

source: [red]Closed {} ago[/red]
fr: [red]Clos depuis {}[/red]

source: [green]{} remaining[/green]
fr: [green]{} restant[/green]

source: :two-thirty: [red]Closed {} ago
fr: :two-thirty: [red]Clos depuis {}

source: :two-thirty: [green]{} remaining
fr: :two-thirty: [green]{} restant

source: :book: [bold red]CodiMD not set
fr: :book: [bold red]CodiMD non renseigné

source: :locked_with_key: [bold red]Credentials not set
fr: :locked_with_key: [bold red]Informations de connexion non renseignées

source: :locked_with_key: Credentials > {}
fr: :locked_with_key: Informations de connexion > {}

source: [bold]#{}[/bold] (save to update)
fr: [bold]#{}[/bold] (sauvegardez pour mettre à jour)

source: #{} (save to update)
fr: #{} (sauvegardez pour mettre à jour)

source: :desktop_computer: Scope
fr: :desktop_computer: Périmètre

source: :spiral_notepad: [magenta]Activity
fr: :spiral_notepad: [magenta]Activité

source: [bold]{} ago[/bold] - #{} - {}
fr: [bold]Il y a {}[/bold] - #{} - {}

source: Model name
fr: Nom du modèle

source: List
fr: Listage

source: Create
fr: Création

source: Read
fr: Lecture

source: Update (full)
fr: Mise à jour (complète)

source: Update (partial)
fr: Mise à jour (partielle)

source: Delete
fr: Suppression

source: Can upload host: {}
fr: Peut téléverser un hôte : {}

source: Name (trigram)
fr: Nom (trigramme)

source: Phone
fr: Téléphone

source: City
fr: Ville

source: Email address
fr: Adresse email

source: Enabled
fr: Activé

source: Roles
fr: Rôles

source: Assigned missions
fr: Missions assignées

source: [green]Yes
fr: [green]Oui

source: [red]No
fr: [red]Non

source: None
fr: Aucune

source: Contact name
fr: Nom du contact

source: Phone number
fr: Numéro de téléphone

source: Remediation
fr: Contre-mesure

source: Created
fr: Date de création

source: Found
fr: Date de découverte

source: Technology
fr: Technologie

source: Checked
fr: Audité

source: Vulnerabilities
fr: Vulnérabilités

source: [bold red]Undefined[/bold red]
fr: [bold red]Non défini[/bold red]

source: A command-line client for the SMERSH collaborative pentest tool
fr: Un client en ligne de commande pour l'outil de pentest collaboratif SMERSH

source: The URL of the SMERSH backend server
fr: L'adresse URL du serveur SMERSH

source: The path to the certificate used to authenticate the server
fr: Le chemin du certificat à utiliser pour authentifier le serveur

source: Disable server authentication. Please, do NOT use this option in production
fr: Désactive l'authentification du serveur. N'utilisez PAS cette option en production

source: Welcome to the SMERSH command-line client
fr: Bienvenue sur le client en ligne de commande SMERSH

source: [red]The file {} does not exist.
fr: [red]Le fichier {} n'existe pas.

source: [bold yellow]WARNING:[/bold yellow][yellow] The program is currently running in [bold yellow]INSECURE[/bold yellow] mode. Server authenticity will not be checked.
fr: [bold yellow]ATTENTION:[/bold yellow][yellow] Le programme fonctionne en mode [bold yellow]INSECURE[/bold yellow]. L'authenticité du serveur ne sera pas vérifiée.

source: Enter your username:
fr: Entez votre nom d'utilisateur :

source: Enter your password (will not be echoed):
fr: Entrez votre mot de passe (ne sera pas affiché) :

source: [green]:heavy_check_mark: Hello, [bold]{}[/bold]. You are successfully logged in
fr: [green]:heavy_check_mark: Bonjour, [bold]{}[/bold]. Vous êtes connecté avec succès

source: [red]:cross_mark: Unable to log you in. Your credentials seem invalid
fr: [red]:cross_mark: Impossible de vous authentifier. Vos informations de connexion semblent incorrectes

source: [red]Oh no. I can't connect to the specified URL. Please check there is no typo and that the host accepts connections then try again.
fr: [red]Oh non. Impossible de se connecter à l'adresse URL spécifiée. Veuillez vérifier que vous n'avez pas fait de faute de frappe et que l'hôte accepte les connexions puis réessayez.

source: [red]An HTTP error occurred (code {}): {}
fr: [red]Une erreur HTTP est survenue : {}

source: day
fr: jour

source: hour
fr: heure

source: second
fr: seconde
